
#********8 (Slicing) وا  (join()) تدريبات عن ****************

#****** \ اصلاح الجمل المعكوسه او عكس الجمل المرتبه  |****************


#************************************************************************

# *    (1)** باستخدام جوين مفهوم منطقي *************
#* طريقة عكس الجمله التي يدخلها المستخدم
sentence= input("Enter a sentence: ")
worbs = sentence.split()
print(" ".join(worbs[::-1]))


# *   (2)** للكلمات او شي معين في متغير *************

#* طريقة عكس الكلمات مع حروفها
name="Riad Alhlaly"
print(name[::-1]) # اطبع من الخلف يعني خذ خطوة الى خلف



#*   (3)** الاهم والمفهوم **************************

#* طلب من المستخدم ادخال جمله
easy=input("Enter a sentence: ").split()
#* يقوم البرنامج بفصل الكلمات الجمله المدخله

#* يطبع الجمله في قائمة ويقوم بعكس ترتيب كلمات الجمله
print(easy[::-1])#* سالب واحد يعني \ ابدا الطباعه من الاخر وانتقل خطوه الى الخرف واستمر في الطباعه  الى ان تنتهي

#* تحرير الجمله المعكوسف داخل القائمة الى جمله نصيه معكوسه بدون قائمة
print("Reversed sentence: "," ".join(easy[::-1]))

