
# *print("""
#  *    ((مشروع الاسماء واختصارها))
     
# *     بيطلب من المستخدم كتابة اسماء اصدقائة اسم الشحص واسم الاب له
     
#  *    عند تشغيل البرنامج بيضهر له
#    *  مجموعه قوائم على حسب الاسما التي ادخلها 
#   *   يعني اسم الشخص واسم الاب له في قائمة ولاكن منفصلين
     
#     * وبعدها بيضهر له
#      *اختصار للاسماء التي ادخلها
#   *   يعني اول حرف من اسم الشخص وبعده فاصله وبعدها اول حرف من اسم الاب الى انت تنتهي الاسماء
      
#    *   """)
#************************** (   الكود )**************

#* ادخال الاسماء وفصلهم
name=input("Enter the first and last name of your friends separated by a comma:").split(", ")

#* قائمة لاختصار الاسماء
name_list=[]


for num in name:
    numbr=num.split() #* فصل الاسم ووضعه في قائمة لحاله
    
    print(numbr)
    
    #*  متغيرات لكي تاخذ الحرف المطلوب طباعته للاختصار
    on_name=numbr[0]
    to_name=numbr[1]
    
    on_list=on_name[0]
    to_list=to_name[0]
    
    # * تخزين ما تم اختصاره في المتغير الجديد
    sums=on_list +"."+to_list+"."
    name_list.append(sums)
    
#* قائمة الاختصارات    
print("Abbreviated Names:")
for x in name_list:
    
    print(x)
    
    
    
    

#** مشروع يطلب من المستخدم 

#*1* دخل اسماء اصدقائك مع مراعاه اسم الشخص واسم عائلته ****

#** اذا اشتغا البرنامج بيضهر له اولا مجموعه من القوائم كل قائمة فيها اسم الشخص مفصول عن اسم عائلته **
#** المطبوع ثانيا سطر يقول \ اختصارات الاسماء 
#** المطبوع ثالثاّ \ اول حرف من اسم الشخص وبجانبه اول حرف من اسم عائلتة

#** المطلوب استخدامه
#*1)-- (join())
#*2)-- (split())
#*3)-- (append())
#*4)-- (slice) [0:0]
    
