
#**************** مشروع حاسبة التسوق *************

#*** (Rangr)تعلم ال *****

#*** برنامج يطلب منك ادخال عدد الاصناف التي معاك*
#* بعد ادخال عدد الاصناف
#* بيسالك عليهم كلهم واحد واحد
#* اولاً بيطلب منك ادخال اسم الصنف وبعده بيسالك كم سعره الى ان ينتهي من  الاصناف كلها
#* اذا خلص من الاصناف بيساك هل تريد رؤية الاصناف الموجوده في سلتك
#* وبعدها بيسالك هل تريد ان اعرض لك السعر الاجمالي للاصناف


#********************** الكود ***************************
# قائمة للمنتجات
name=[]
# قائمة لاسعار المنتجات
mony=[]

print("**** Welcome to iShop calculator ****\n")

#بعد رسالة الترحيب بيطلب من المستخدم ادخال عدد الاصناف
numpr=int(input("How many items are there in your basket today? "))

# التحقق اذا كان مدخل رقم اكبر من صفر 
if numpr >0:
    
    print("Let;s get to counting them ....")
    
#   التكرار لكي يقوم البرنامج بتحليل     
    for i in range(0,numpr):
        
        
        # سوال يطلب من المستخدم ادخال اسم الصنف
        names=input(f"Please tall me the name of th eitem number {i+1}: ")
        name.append(names)# بعد ادخال الصنف تقوم الداله بتخزينه في قائمة الاصناف
        
    #(Float) اذا كان معنا عمله يمنية واذا كان معنا عمله دولار او سعودي نستخدم النتغير   (int) نستخدم 
        # سوال يطلب من المستخدم ادخال سعر الصنف
        muny=float(input(f"What is the price of {names}\n$"))
        mony.append(muny)# تقوم الداله بتخزين السعر في قائمة اسعال المنتجات
    
    #  سوال هل تريد رؤية كل الاصناف نعم او لا
    guab=input("Would you like to see tour entire basket item (Yes or No)? ").lower()
    
    if guab=='yes':# لو ادخل نعم اريد رؤية الاصناف
        print(name)# طباعة قائمة الاصناف الموجوده فيها
        
        #  سوال هل تريد رؤية التكلفة للاسعار
        sar=input("Would you like to see how much it'll cost (Yes or No)? ").lower()
    
        if sar=="yes":# لو ادخل نعم اريد رؤية الاسعار
            print("Buying these items will cost:\n")# اسعار الاصناف هي
            print(sum(mony))# يطبع له قائمة الاسعار 
            #لكي اقوم بجمع الاسعار في الفائمة (sum) استخدام دالة 
    
        else: # اذا ادخل لا او شي اخر 
            print("Sorre, not itmes")# يطبع له اسف خطاء في التحقق
    #       للاسعار
    
    else: # اذا ادخل لا او شي اخر 
        print("Sorre, not itmes")# يطبع له اسف خطاء في التحقق
        # للاصناف
            
else: # لو المستخدم ادخل عدد اصناف اصغر من الصفر 
    print("Sorre, you con't hervun ")# يطبع له انت مزاجك ليس بالتسوق        